                          Homework 3.
Задачи на строки
1.	Дана строка. Ввод через input()
- Сначала выведите третий символ этой строки. 
- Во второй строке выведите предпоследний символ этой строки.
- В третьей строке выведите первые пять символов этой строки.
- В четвертой строке выведите всю строку, кроме последних двух символов.
- В пятой строке выведите все символы с четными индексами
- В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
- В седьмой строке выведите все символы в обратном порядке.
- В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
- В девятой строке выведите длину данной строки.
2.	Дано слово. Верно ли, что оно начинается и оканчивается на одну и ту же букву?
3.	Из слова яблоко путем "вырезок" и "склеек" его букв получить слова блок и око.
4.	Дана строка “*”. Получить строку, состоящую из пяти звездочек (символов "*").
5.	Проверить является ли строка палиндромом.(шалаш).
6.	Дана строка. Если в этой строке буква f встречается только один раз, выведите её индекс.  Если она встречается два и более раз, выведите индекс её первого появления и количество букв f. Если буква f в данной строке не встречается, ничего не выводите
7.	Дана строка. Замените в этой строке все цифры 1 на слово one.


Дополнительные задачи 

8.	Дана строка. Найдите в этой строке второе вхождение буквы f, и выведите индекс этого вхождения. Если буква f в данной строке встречается только один раз, выведите число -1, а если не встречается ни разу, выведите число -2.
9.	Дан текст. Слова в тексте разделены одним или несколькими пробелами. Написать программу определяющую количество слов, заканчивающихся одной и той же буквой ‘f’. 
10.	Уберите точки из введенного IP-адреса. Выведите сначала четыре числа через пробел, а затем сумму получившихся чисел
7.	Дана строка. Замените в этой строке все цифры 1 на слово one.


Дополнительные задачи 

8.	Дана строка. Найдите в этой строке второе вхождение буквы f, и выведите индекс этого вхождения. Если буква f в данной строке встречается только один раз, выведите число -1, а если не встречается ни разу, выведите число -2.
9.	Дан текст. Слова в тексте разделены одним или несколькими пробелами. Написать программу определяющую количество слов, заканчивающихся одной и той же буквой ‘f’. 
10.	Уберите точки из введенного IP-адреса. Выведите сначала четыре числа через пробел, а затем сумму получившихся чисел


                                                     1

s1 = input()
print(s1[0:3])
print(s1[3])
s2 = print(input(),(s[0],s[-2]))
s3 = print(input(),(s[0],s[-6]))
s4 = print(input(),(s[0],s[len(s)-3]))
s5 = print(input(),(s[::2]),s[len(s)])
s6 = print(input(),(s[2],s[len(s)]))
s7 = print(input(),(s[-1],s[len(s)[0]]))
s8 = print(input(),(s[-1],s[len(s)]))
s9 = print(input(),(s[0],s[len(s)]))

                                                       2

s[0] != s[-1] and print('False')
s[0] == s[-1] and print('True')


                                                       3


s1 = 'яблоко'
s2 = print((s[1],s[4])+(s[3],s[5]))


                                                         4



s1 = '*'
s2 = s1 * 5
print(s1)
print(s2)


                                                         5


s = 'шалаш'
if str(s) == str(s)[::-1]:
    print('строка является палиндромом')
else:
    print('строка не является палиндромом')


                                                         6


s = input()
a = s.find('f')
b = s.rfind('f')
if a == -1:
    print()
elif a == b:
    print(a)
else:
    print(a,b)


                                                           7
 


s = input()
print(s.replace(1,'one'))



                                                            8
      



s = input()
a = s.find('f')
b = s.rfind('f')
if a == -1:
    print()
elif a == b:
    print(a)
else:
    print(-2)

********************

s = input()
a = s.find('f')
b = s.rfind('f')
if a == -1:
 if s.find('f').count() == 1:    
    print(-1)
elif a == b:
    print(a)
else:
    print(-2)



                                                          9



import re

s = str(input('Enter string'))
print(len(re.findall(r'f',"",'f',string)))



                                                          10



enter_IP = int('192.168.0.1')
my_list = int(my_str.split('.'))
for i_numb in enter_IP:
 if i_numb.isdigit():
     print(f'{i_numb}.split(" ")')
     print(sum(f"{i_numb}"))

